Repository: cleveland-lewis/Itori
Catalog: SharedCore/DesignSystem/Localizable.xcstrings
Source language: en
Languages: ar, az, bg, bn, ca, da, de, es, fa, fi, fr, he, hr, hy, is, it, ja, ko, nl, ru, sq, sw, th, uk, vi, zh_hans, zh_hant, zh_hk

# planner.task_sheet.field.assignment
source: Assignment
ar: تكليف
da: Opgave
de: planner.task_sheet.field.assignment
es: Tarea
fa: تکلیف
fi: Tehtävä
fr: Affectation
he: planner.task_sheet.field.assignment
it: Compito
ja: 割り当て
nl: Opdracht
ru: Задание
sw: Mgawo
th: งานที่มอบหมาย
zh_hans: 作业
zh_hant: 作業
zh_hk: 任務

# planner.task_sheet.field.assignment_linked
source: Linked
ar: مرتبط
da: Forbundet
de: planner.task_sheet.field.assignment_linked
es: Vinculado
fa: پیوند داده شده است
fi: Linkitetty
fr: Lié
he: planner.task_sheet.field.assignment_linked
it: Collegato
ja: リンク済み
nl: Gekoppeld
ru: Связано
sw: Imeunganishwa
th: เชื่อมโยงแล้ว
uk: Пов'язано
zh_hans: 已链接
zh_hant: 已連結
zh_hk: 鏈接

# planner.task_sheet.field.assignment_placeholder
source: Assignment link (optional)
ar: رابط المهمة (اختياري)
da: Opgavelink (valgfrit)
de: planner.task_sheet.field.assignment_placeholder
es: Enlace de tarea (opcional)
fa: لینک تکلیف (اختیاری)
fi: Tehtävälinkki (valinnainen)
fr: Lien de devoir (facultatif)
he: planner.task_sheet.field.assignment_placeholder
it: Link del compito (facoltativo)
ja: 割り当てリンク (オプション)
nl: Opdrachtlink (optioneel)
ru: Связь с заданием (опционально)
sw: Kiungo cha mgawo (si lazima)
th: ลิงค์งาน (ไม่บังคับ)
zh_hans: 作业链接（可选）
zh_hant: 作業連結（選填）
zh_hk: 作業鏈接（可選）

# planner.task_sheet.field.course
source: Course
ar: دورة
da: Kursus
de: planner.task_sheet.field.course
es: Curso
fa: دوره
fi: Kurssi
fr: Cours
he: planner.task_sheet.field.course
ja: コース
nl: Cursus
ru: Курс
sw: Kozi
th: คอร์ส
uk: курс
zh_hans: 课程
zh_hant: 課程
zh_hk: 課程

# planner.task_sheet.field.course_none
source: None
ar: لا أحد
da: Ingen
de: planner.task_sheet.field.course_none
es: Ninguno
fa: هیچ کدام
fi: Ei mitään
fr: Aucun
he: planner.task_sheet.field.course_none
it: Nessuno
ja: なし
nl: Geen
ru: Нет
sw: Hakuna
th: ไม่มี
uk: Жодного
zh_hans: 无
zh_hant: 無
zh_hk: 沒有任何

# planner.task_sheet.field.due_date
source: Due date
ar: تاريخ الاستحقاق
da: Forfaldsdato
de: planner.task_sheet.field.due_date
es: Fecha de entrega
fa: سررسید
fi: Eräpäivä
fr: Date d'échéance
he: planner.task_sheet.field.due_date
it: Scadenza
ja: 期日
nl: Deadline
ru: Срок сдачи
sw: Tarehe ya mwisho
th: วันครบกำหนด
uk: Термін виконання
zh_hans: 截止日期
zh_hant: 截止日期
zh_hk: 到期日

# planner.task_sheet.field.focus_estimate
source: Focus estimate
ar: تقدير التركيز
da: Fokus estimat
de: planner.task_sheet.field.focus_estimate
es: Estimación de enfoque
fa: برآورد تمرکز
fi: Tarkennusarvio
fr: Estimation de mise au point
he: planner.task_sheet.field.focus_estimate
it: Stima del focus
ja: 焦点の推定
nl: Schatting van de focus
ru: Оценка фокуса
sw: Kuzingatia makadirio
th: การประมาณโฟกัส
uk: Фокус оцінка
zh_hans: 专注时间估计
zh_hant: 專注時間估計
zh_hk: 焦點估計

# planner.task_sheet.field.lock_due_date
source: Lock to exact due date
ar: قفل لتاريخ الاستحقاق المحدد
da: Lås til nøjagtig forfaldsdato
de: planner.task_sheet.field.lock_due_date
es: Bloquear en fecha de entrega exacta
fa: به تاریخ دقیق سررسید قفل کنید
fi: Lukitse tarkkaan eräpäivään
fr: Verrouiller à la date d'échéance exacte
he: planner.task_sheet.field.lock_due_date
it: Blocca alla data di scadenza esatta
ja: 正確な期日をロックする
nl: Vergrendel de exacte vervaldatum
ru: Зафиксировать на дату сдачи
sw: Funga hadi tarehe kamili ya kukamilisha
th: ล็อคให้ถึงวันครบกำหนดที่แน่นอน
uk: Зафіксувати точну дату виконання
zh_hans: 锁定到确切的截止日期
zh_hant: 鎖定到確切的截止日期
zh_hk: 鎖定確切的截止日期

# planner.task_sheet.field.lock_due_date_help
source: When locked, the LLM planner schedules this block only on the due date.
ar: عند القفل، يقوم مخطط LLM بجدولة هذه الكتلة فقط في تاريخ الاستحقاق.
da: Når den er låst, planlægger LLM-planlæggeren kun denne blok på forfaldsdatoen.
de: planner.task_sheet.field.lock_due_date_help
es: Cuando está bloqueado, el planificador LLM programa este bloque solo en la fecha de entrega.
fa: هنگامی که قفل است، برنامه ریز LLM این بلوک را فقط در تاریخ مقرر برنامه ریزی می کند.
fi: Kun se on lukittu, LLM-suunnittelija ajoittaa tämän lohkon vain eräpäivänä.
fr: Lorsqu'il est verrouillé, le planificateur LLM planifie ce bloc uniquement à la date d'échéance.
he: planner.task_sheet.field.lock_due_date_help
it: Quando bloccato, il pianificatore LLM pianifica questo blocco solo alla data di scadenza.
ja: ロックされている場合、LLM プランナーはこのブロックを期日にのみスケジュールします。
nl: Indien vergrendeld, plant de LLM-planner dit blok alleen op de vervaldatum.
ru: При фиксации LLM планировщик планирует блок только на дату сдачи.
sw: Inapofungwa, mpangaji wa LLM hupanga zuio hili kwa tarehe iliyowekwa pekee.
th: เมื่อล็อค ผู้วางแผน LLM จะกำหนดเวลาบล็อกนี้เฉพาะในวันที่ครบกำหนดเท่านั้น
uk: Якщо заблоковано, планувальник LLM планує цей блок лише на дату виконання.
zh_hans: 锁定后，LLM 计划器仅在截止日期安排此时间段。
zh_hant: 鎖定後，LLM 規劃器僅在截止日期安排此時間段。
zh_hk: 鎖定後，LLM 規劃師僅在到期日安排此塊。

# planner.task_sheet.field.minutes
source: min
ar: دقيقة
de: planner.task_sheet.field.minutes
fa: دقیقه
he: planner.task_sheet.field.minutes
ja: 分
ru: мин
th: นาที
uk: хв
zh_hans: 分钟
zh_hant: 分鐘
zh_hk: 分鐘

# planner.task_sheet.field.priority
source: Priority
ar: أولوية
da: Prioritet
de: planner.task_sheet.field.priority
es: Prioridad
fa: اولویت
fi: Prioriteetti
fr: Priorité
he: planner.task_sheet.field.priority
it: Priorità
ja: 優先度
nl: Prioriteit
ru: Приоритет
sw: Kipaumbele
th: ลำดับความสำคัญ
uk: Пріоритет
zh_hans: 优先级
zh_hant: 優先順序
zh_hk: 優先事項

# planner.task_sheet.field.title
source: Title
ar: عنوان
da: Titel
de: planner.task_sheet.field.title
es: Título
fa: عنوان
fi: Otsikko
fr: Titre
he: planner.task_sheet.field.title
it: Titolo
ja: タイトル
nl: Titel
ru: Название
sw: Kichwa
th: ชื่อ
uk: Назва
zh_hans: 标题
zh_hant: 標題
zh_hk: 標題

# planner.task_sheet.new_title
source: New Task
ar: مهمة جديدة
da: Ny opgave
de: planner.task_sheet.new_title
es: Nueva Tarea
fa: وظیفه جدید
fi: Uusi tehtävä
fr: Nouvelle tâche
he: planner.task_sheet.new_title
it: Nuovo compito
ja: 新しいタスク
nl: Nieuwe taak
ru: Новая задача
sw: Kazi Mpya
th: งานใหม่
uk: Нове завдання
zh_hans: 新建任务
zh_hant: 新增任務
zh_hk: 新任務

# planner.task_sheet.section.course
source: Course
ar: دورة
da: Kursus
de: planner.task_sheet.section.course
es: Curso
fa: دوره
fi: Kurssi
fr: Cours
he: planner.task_sheet.section.course
ja: コース
nl: Cursus
ru: Курс
sw: Kozi
th: คอร์ส
uk: курс
zh_hans: 课程
zh_hant: 課程
zh_hk: 課程

# planner.task_sheet.section.task
source: Task
ar: مهمة
da: Opgave
de: planner.task_sheet.section.task
es: Tarea
fa: وظیفه
fi: Tehtävä
fr: Tâche
he: planner.task_sheet.section.task
it: Compito
ja: タスク
nl: Taak
ru: Задача
sw: Kazi
th: งาน
zh_hans: 任务
zh_hant: 任務
zh_hk: 任務

# planner.task_sheet.section.timing
source: Timing
ar: توقيت
de: planner.task_sheet.section.timing
es: Tiempo
fa: زمان بندی
fi: Ajoitus
he: planner.task_sheet.section.timing
ja: タイミング
nl: Tijdstip
ru: Время
sw: Muda
th: เวลา
uk: Час
zh_hans: 时间
zh_hant: 時間
zh_hk: 定時

# planner.task_sheet.subtitle
source: Tasks are auto-scheduled into the Planner timeline.
ar: تتم جدولة المهام تلقائيًا في المخطط الزمني للمخطط.
da: Opgaver planlægges automatisk i Planner-tidslinjen.
de: planner.task_sheet.subtitle
es: Las tareas se programan automáticamente en la línea de tiempo del Planificador.
fa: وظایف به طور خودکار در جدول زمانی Planner برنامه ریزی می شوند.
fi: Tehtävät ajoitetaan automaattisesti Plannerin aikajanalle.
fr: Les tâches sont automatiquement planifiées dans la chronologie du planificateur.
he: planner.task_sheet.subtitle
it: Le attività vengono pianificate automaticamente nella sequenza temporale di Planner.
ja: タスクは Planner タイムラインに自動的にスケジュールされます。
nl: Taken worden automatisch gepland in de Planner-tijdlijn.
ru: Задачи автоматически планируются в расписании.
sw: Majukumu yamepangwa kiotomatiki katika rekodi ya matukio ya Kipanga.
th: งานจะถูกจัดกำหนดการอัตโนมัติในไทม์ไลน์ของ Planner
uk: Завдання автоматично плануються на часовій шкалі Планувальника.
zh_hans: 任务会自动安排到计划器时间轴中。
zh_hant: 任務會自動安排到規劃器時間軸中。
zh_hk: 任務會自動安排到 Planner 時間線中。

# planner.timeline.free
source: Free
ar: حر
da: Gratis
de: planner.timeline.free
es: Libre
fa: رایگان
fi: Ilmainen
fr: Gratuit
he: planner.timeline.free
ja: 無料
nl: Vrij
ru: Свободно
sw: Bure
th: ฟรี
uk: безкоштовно
zh_hans: 空闲
zh_hant: 空閒
zh_hk: 自由的

# planner.timeline.overflow
source: overflow
ar: تجاوز
da: flyde over
de: planner.timeline.overflow
es: excedente
fa: سرریز
fi: ylivuoto
fr: débordement
he: planner.timeline.overflow
it: traboccare
ja: オーバーフロー
nl: overloop
ru: переполнение
sw: kufurika
th: ล้น
uk: перелив
zh_hans: 溢出
zh_hant: 溢位
zh_hk: 溢出

# planner.timeline.title
source: Planner Timeline
ar: الجدول الزمني للمخطط
da: Planlægger tidslinje
de: planner.timeline.title
es: Línea de Tiempo del Planificador
fa: جدول زمانی برنامه ریز
fi: Suunnittelijan aikajana
fr: Chronologie
he: planner.timeline.title
it: Timeline
ja: プランナーのタイムライン
nl: Planner-tijdlijn
ru: Расписание планировщика
sw: Ratiba ya Mpangaji
th: ไทม์ไลน์ของผู้วางแผน
uk: Хронологія планувальника
zh_hans: 计划器时间轴
zh_hant: 規劃器時間軸
zh_hk: 規劃時間表

# planner.unscheduled.empty
source: No overflow tasks from the planner right now.
ar: لا توجد مهام تجاوز السعة من المخطط في الوقت الحالي.
da: Ingen overløbsopgaver fra planlæggeren lige nu.
de: planner.unscheduled.empty
es: No hay tareas excedentes del planificador en este momento.
fa: در حال حاضر هیچ کار سرریز از طرف برنامه ریز وجود ندارد.
fi: Ei ylivuototehtäviä suunnittelijalta juuri nyt.
fr: Tout est planifié !
he: planner.unscheduled.empty
it: Nessun compito non pianificato
ja: 現在、プランナーからのオーバーフロー タスクはありません。
nl: Er zijn momenteel geen overlooptaken vanuit de planner.
ru: Сейчас нет задач переполнения из планировщика.
sw: Hakuna kazi za ziada kutoka kwa kipangaji kwa sasa.
th: ไม่มีงานล้นจากผู้วางแผนในขณะนี้
uk: Зараз немає надлишкових завдань із планувальника.
zh_hans: 目前没有来自计划器的溢出任务。
zh_hant: 目前沒有來自規劃器的溢位任務。
zh_hk: 目前計劃器沒有溢出任務。

# planner.unscheduled.title
source: Unscheduled Tasks
ar: المهام غير المجدولة
da: Uplanlagte opgaver
de: planner.unscheduled.title
es: Tareas No Programadas
fa: وظایف برنامه ریزی نشده
fi: Suunnittelemattomat tehtävät
fr: Non planifié
he: planner.unscheduled.title
it: Non Pianificato
ja: スケジュールされていないタスク
nl: Ongeplande taken
ru: Незапланированные задачи
sw: Kazi Zisizoratibiwa
th: งานที่ไม่ได้กำหนดไว้
uk: Позапланові завдання
zh_hans: 未安排的任务
zh_hant: 未安排的任務
zh_hk: 計劃外任務

# planner.updated
source: Updated %@
ar: تم التحديث %@
da: Opdateret %@
de: planner.updated
es: Actualizado %@
fa: %@ به روز شد
fi: Päivitetty %@
fr: Mis à jour %@
he: planner.updated
ja: %@ を更新しました
nl: %@ bijgewerkt
sw: Ilisasishwa %@
th: อัปเดต %@
uk: Оновлено %@
zh_hans: 已更新%@
zh_hant: 已更新%@
zh_hk: 已更新%@

# practice.action.back
source: Back
ar: خلف
da: Tilbage
de: practice.action.back
es: Atrás
fa: برگشت
fi: Takaisin
fr: Dos
he: practice.action.back
it: Indietro
ja: 戻る
nl: Rug
sw: Nyuma
th: กลับ
uk: Назад
zh_hans: 返回
zh_hant: 返回
zh_hk: 後退

# practice.action.back_to_tests
source: Back to Tests
ar: العودة إلى الاختبارات
da: Tilbage til Tests
de: practice.action.back_to_tests
es: Volver a Exámenes
fa: بازگشت به تست ها
fi: Takaisin Testeihin
fr: Retour aux Tests
he: practice.action.back_to_tests
it: Torniamo ai test
ja: テストに戻る
nl: Terug naar Testen
sw: Rudi kwa Majaribio
th: กลับไปที่การทดสอบ
uk: Назад до тестів
zh_hans: 返回测试
zh_hant: 返回測試
zh_hk: 返回測試

# practice.action.cancel
source: Cancel
ar: يلغي
da: Ophæve
de: practice.action.cancel
es: Cancelar
fa: لغو کنید
fi: Peruuttaa
fr: Annuler
he: practice.action.cancel
it: Cancellare
ja: キャンセル
nl: Annuleren
sw: Ghairi
th: ยกเลิก
uk: Скасувати
zh_hans: 取消
zh_hant: 取消
zh_hk: 取消

# practice.action.generate
source: Generate Test
ar: توليد اختبار
da: Generer test
de: practice.action.generate
es: Generar Examen
fa: تولید تست
fi: Luo testi
fr: Générer un test
he: practice.action.generate
it: Genera prova
ja: テストの生成
nl: Test genereren
sw: Tengeneza Mtihani
th: สร้างการทดสอบ
uk: Згенерувати тест
zh_hans: 生成测试
zh_hant: 生成測試
zh_hk: 生成測試

# practice.action.new_test
source: New Test
ar: اختبار جديد
da: Ny test
de: practice.action.new_test
es: Nuevo Examen
fa: تست جدید
fi: Uusi testi
fr: Nouvel essai
he: practice.action.new_test
it: Nuova prova
ja: 新しいテスト
nl: Nieuwe proef
sw: Mtihani Mpya
th: การทดสอบใหม่
uk: Новий тест
zh_hans: 新测试
zh_hant: 新測試
zh_hk: 新測試

# practice.action.next
source: Next
ar: التالي
da: Næste
de: practice.action.next
es: Siguiente
fa: بعدی
fi: Seuraavaksi
fr: Suivant
he: practice.action.next
ja: 次
nl: Volgende
sw: Inayofuata
th: ต่อไป
uk: Далі
zh_hans: 下一个
zh_hant: 下一個
zh_hk: 下一個

# practice.action.previous
source: Previous
ar: سابق
da: Tidligere
de: practice.action.previous
es: Anterior
fa: قبلی
fi: Edellinen
fr: Précédent
he: practice.action.previous
it: Precedente
ja: 前の
nl: Vorig
sw: Iliyotangulia
th: ก่อนหน้า
uk: Попередній
zh_hans: 上一个
zh_hant: 上一個
zh_hk: 以前的

# practice.action.submit
source: Submit Test
ar: إرسال الاختبار
da: Indsend test
de: practice.action.submit
es: Enviar Examen
fa: ارسال تست
fi: Lähetä testi
fr: Soumettre le test
he: practice.action.submit
it: Invia prova
ja: テストを送信する
nl: Test indienen
sw: Peana Mtihani
th: ส่งแบบทดสอบ
zh_hans: 提交测试
zh_hant: 提交測試
zh_hk: 提交測試

# practice.empty.message
source: Create your first practice test to start learning
ar: قم بإنشاء أول اختبار تدريبي لبدء التعلم
da: Opret din første øvelsestest for at begynde at lære
de: practice.empty.message
es: Crea tu primer examen de práctica para comenzar a aprender
fa: اولین آزمون تمرینی خود را برای شروع یادگیری ایجاد کنید
fi: Luo ensimmäinen harjoitustesti aloittaaksesi oppimisen
fr: Créez votre premier test pratique pour commencer à apprendre
he: practice.empty.message
it: Crea il tuo primo test pratico per iniziare ad apprendere
ja: 最初の練習テストを作成して学習を開始しましょう
nl: Maak uw eerste oefentoets om te beginnen met leren
sw: Unda jaribio lako la kwanza la mazoezi ili kuanza kujifunza
th: สร้างแบบทดสอบฝึกหัดครั้งแรกเพื่อเริ่มการเรียนรู้
uk: Створіть свій перший практичний тест, щоб почати навчання
zh_hans: 创建您的第一个练习测试以开始学习
zh_hant: 建立您的第一個練習測試以開始學習
zh_hk: 創建您的第一個練習測試以開始學習

# practice.empty.no_results
source: No Results
ar: لا توجد نتائج
da: Ingen resultater
de: practice.empty.no_results
es: Sin Resultados
fa: بدون نتیجه
fi: Ei tuloksia
fr: Aucun résultat
he: practice.empty.no_results
it: Nessun risultato
ja: 結果はありません
nl: Geen resultaten
sw: Hakuna Matokeo
th: ไม่มีผลลัพธ์
uk: Немає результатів
zh_hans: 无结果
zh_hant: 無結果
zh_hk: 沒有結果

# practice.empty.select_question
source: Select a question to review
ar: حدد سؤالاً للمراجعة
da: Vælg et spørgsmål, der skal gennemgås
de: practice.empty.select_question
es: Selecciona una pregunta para revisar
fa: یک سوال را برای بررسی انتخاب کنید
fi: Valitse tarkistettava kysymys
fr: Sélectionnez une question à examiner
he: practice.empty.select_question
it: Seleziona una domanda da rivedere
ja: 確認する質問を選択してください
nl: Selecteer een vraag om te beoordelen
sw: Chagua swali la kukagua
th: เลือกคำถามที่จะทบทวน
uk: Виберіть питання для перегляду
zh_hans: 选择一个问题以查看
zh_hant: 選擇一個問題以查看
zh_hk: 選擇要查看的問題

# practice.empty.title
source: No Practice Tests Yet
ar: لا توجد اختبارات الممارسة حتى الآن
da: Ingen øvelsesprøver endnu
de: practice.empty.title
es: Aún No Hay Exámenes de Práctica
fa: هنوز تست تمرینی وجود ندارد
fi: Ei vielä harjoituskokeita
fr: Aucun test pratique pour l'instant
he: practice.empty.title
it: Ancora nessuna prova pratica
ja: 模擬テストはまだありません
nl: Nog geen oefentoetsen
sw: Bado Hakuna Majaribio ya Mazoezi
th: ยังไม่มีแบบทดสอบฝึกหัด
uk: Практичних тестів ще немає
zh_hans: 还没有练习测试
zh_hant: 還沒有練習測試
zh_hk: 尚未進行練習測試

# practice.generator.course.no_courses
source: No courses available. Please add a course first.
ar: لا توجد دورات متاحة.الرجاء إضافة دورة أولا.
da: Ingen tilgængelige kurser.Tilføj venligst et kursus først.
de: practice.generator.course.no_courses
es: No hay cursos disponibles. Por favor agrega un curso primero.
fa: هیچ دوره ای موجود نیستلطفا ابتدا یک دوره اضافه کنید.
fi: Kursseja ei ole saatavilla.Lisää ensin kurssi.
fr: Aucun cours disponible.Veuillez d'abord ajouter un cours.
he: practice.generator.course.no_courses
it: Nessun corso disponibileAggiungi prima un corso.
ja: 利用可能なコースはありません。まずはコースを追加してください。
nl: Geen cursussen beschikbaar.Voeg eerst een cursus toe.
sw: Hakuna kozi zinazopatikana.Tafadhali ongeza kozi kwanza.
th: ไม่มีหลักสูตรที่เปิดสอนกรุณาเพิ่มหลักสูตรก่อน
zh_hans: 没有可用的课程。请先添加一个课程。
zh_hant: 沒有可用的課程。請先新增一個課程。
zh_hk: 沒有可用的課程。請先添加課程。

# practice.generator.course.select
source: Select a course
ar: اختر دورة
da: Vælg et kursus
de: practice.generator.course.select
es: Selecciona un curso
fa: یک دوره را انتخاب کنید
fi: Valitse kurssi
fr: Sélectionnez un cours
he: practice.generator.course.select
it: Seleziona un corso
ja: コースを選択してください
nl: Selecteer een cursus
sw: Chagua kozi
th: เลือกหลักสูตร
uk: Виберіть курс
zh_hans: 选择课程
zh_hant: 選擇課程
zh_hk: 選擇課程

# practice.generator.difficulty.label
source: Difficulty
ar: صعوبة
da: Vanskelighed
de: practice.generator.difficulty.label
es: Dificultad
fa: دشواری
fi: Vaikeus
fr: Difficulté
he: practice.generator.difficulty.label
it: Difficoltà
ja: 困難
nl: Moeilijkheidsgraad
sw: Ugumu
th: ความยาก
uk: Складність
zh_hans: 难度
zh_hant: 難度
zh_hk: 困難

# practice.generator.question_count.label
source: Number of Questions
ar: عدد الأسئلة
da: Antal spørgsmål
de: practice.generator.question_count.label
es: Número de Preguntas
fa: تعداد سوالات
fi: Kysymysten määrä
fr: Nombre de questions
he: practice.generator.question_count.label
it: Numero di domande
ja: 質問数
nl: Aantal vragen
sw: Idadi ya Maswali
th: จำนวนคำถาม
uk: Кількість запитань
zh_hans: 问题数量
zh_hant: 問題數量
zh_hk: 問題數量

# practice.generator.section.course
source: Course
ar: دورة
da: Kursus
de: practice.generator.section.course
es: Curso
fa: دوره
fi: Kurssi
fr: Cours
he: practice.generator.section.course
ja: コース
nl: Cursus
sw: Kozi
th: คอร์ส
uk: курс
zh_hans: 课程
zh_hant: 課程
zh_hk: 課程

# practice.generator.section.question_types
source: Question Types
ar: أنواع الأسئلة
da: Spørgsmålstyper
de: practice.generator.section.question_types
es: Tipos de Preguntas
fa: انواع سوال
fi: Kysymystyypit
fr: Types de questions
he: practice.generator.section.question_types
it: Tipi di domande
ja: 質問の種類
nl: Vraagtypen
sw: Aina za Maswali
th: ประเภทคำถาม
uk: Типи запитань
zh_hans: 问题类型
zh_hant: 問題類型
zh_hk: 問題類型

# practice.generator.section.settings
source: Settings
ar: إعدادات
da: Indstillinger
de: practice.generator.section.settings
es: Configuración
fa: تنظیمات
fi: Asetukset
fr: Paramètres
he: practice.generator.section.settings
it: Impostazioni
ja: 設定
nl: Instellingen
sw: Mipangilio
th: การตั้งค่า
zh_hans: 设置
zh_hant: 設定
zh_hk: 設定

# practice.generator.section.topics
source: Topics (Optional)
ar: المواضيع (اختياري)
da: Emner (valgfrit)
de: practice.generator.section.topics
es: Temas (Opcional)
fa: موضوعات (اختیاری)
fi: Aiheet (valinnainen)
fr: Sujets (facultatif)
he: practice.generator.section.topics
it: Argomenti (facoltativo)
ja: トピックス (オプション)
nl: Onderwerpen (optioneel)
sw: Mada (Si lazima)
th: หัวข้อ (ไม่บังคับ)
uk: Теми (необов'язково)
zh_hans: 主题（可选）
zh_hant: 主題（可選）
zh_hk: 主題（可選）

# practice.generator.subtitle
source: Configure your practice test parameters
ar: تكوين معلمات اختبار الممارسة الخاصة بك
da: Konfigurer dine øvelsestestparametre
de: practice.generator.subtitle
es: Configura los parámetros de tu examen de práctica
fa: پارامترهای آزمون تمرینی خود را پیکربندی کنید
fi: Määritä harjoitustestin parametrit
fr: Configurez les paramètres de votre test pratique
he: practice.generator.subtitle
it: Configura i parametri del tuo test pratico
ja: 演習テストのパラメータを設定する
nl: Configureer uw oefentestparameters
sw: Sanidi vigezo vya mtihani wako wa mazoezi
th: กำหนดค่าพารามิเตอร์การทดสอบฝึกหัดของคุณ
zh_hans: 配置你的练习测试参数
zh_hant: 配置你的練習測試參數
zh_hk: 配置您的練習測試參數

# practice.generator.title
source: Generate Practice Test
ar: توليد اختبار الممارسة
da: Generer øvelsestest
de: practice.generator.title
es: Generar Examen de Práctica
fa: تولید تست تمرین
fi: Luo harjoitustesti
fr: Générer un test pratique
he: practice.generator.title
it: Genera prova pratica
ja: 模擬テストの生成
nl: Genereer oefentest
sw: Tengeneza Mtihani wa Mazoezi
th: สร้างแบบทดสอบฝึกหัด
uk: Згенерувати практичний тест
zh_hans: 生成练习测试
zh_hant: 生成練習測試
zh_hk: 生成練習測試

# practice.generator.topics.add_button
source: Add
ar: يضيف
da: Tilføje
de: practice.generator.topics.add_button
es: Agregar
fa: اضافه کنید
fi: Lisätä
fr: Ajouter
he: practice.generator.topics.add_button
it: Aggiungere
ja: 追加
nl: Toevoegen
sw: Ongeza
th: เพิ่ม
uk: додати
zh_hans: 添加
zh_hant: 新增
zh_hk: 添加

# practice.generator.topics.add_field
source: Add topic
ar: إضافة موضوع
da: Tilføj emne
de: practice.generator.topics.add_field
es: Agregar tema
fa: اضافه کردن موضوع
fi: Lisää aihe
fr: Ajouter un sujet
he: practice.generator.topics.add_field
it: Aggiungi argomento
ja: トピックを追加
nl: Onderwerp toevoegen
sw: Ongeza mada
th: เพิ่มหัวข้อ
uk: Додати тему
zh_hans: 添加主题
zh_hant: 新增主題
zh_hk: 添加主題

# practice.generator.topics.help
source: Specify topics to focus on, or leave blank for general practice
ar: حدد الموضوعات التي تريد التركيز عليها، أو اتركها فارغة للممارسة العامة
da: Angiv emner, der skal fokuseres på, eller lad det være tomt til almen praksis
de: practice.generator.topics.help
es: Especifica temas en los que enfocarte, o déjalo en blanco para práctica general
fa: موضوعاتی را برای تمرکز بر روی آنها مشخص کنید یا برای تمرین عمومی خالی بگذارید
fi: Määritä aiheet, joihin haluat keskittyä, tai jätä tyhjäksi yleistä harjoittelua varten
fr: Spécifiez les sujets sur lesquels vous concentrer ou laissez vide pour la médecine générale
he: practice.generator.topics.help
it: Specificare gli argomenti su cui concentrarsi o lasciare vuoto per la medicina generale
ja: 焦点を当てるトピックを指定するか、一般的な練習のために空白のままにしてください
nl: Geef onderwerpen op waarop u zich wilt concentreren, of laat niets over voor de algemene praktijk
sw: Bainisha mada za kuzingatia, au acha wazi kwa mazoezi ya jumla
th: ระบุหัวข้อที่จะเน้น หรือเว้นว่างไว้สำหรับการฝึกปฏิบัติทั่วไป
uk: Укажіть теми, на яких потрібно зосередитися, або залиште поле порожнім для загальної практики
zh_hans: 指定要关注的主题，或留空以进行一般练习
zh_hant: 指定要關注的主題，或留空以進行一般練習
zh_hk: 指定要關注的主題，或留空以供一般實踐

# practice.generator.types.explanation
source: Explanation
ar: توضيح
da: Forklaring
de: practice.generator.types.explanation
es: Explicación
fa: توضیح
fi: Selitys
fr: Explication
he: practice.generator.types.explanation
it: Spiegazione
ja: 説明
nl: Uitleg
sw: Maelezo
th: คำอธิบาย
uk: Пояснення
zh_hans: 解释题
zh_hant: 解釋題
zh_hk: 解釋

# practice.generator.types.explanation_desc
source: Detailed explanations with examples
ar: شرح مفصل مع الأمثلة
da: Detaljerede forklaringer med eksempler
de: practice.generator.types.explanation_desc
es: Explicaciones detalladas con ejemplos
fa: توضیحات مفصل همراه با مثال
fi: Yksityiskohtaiset selitykset esimerkein
fr: Explications détaillées avec exemples
he: practice.generator.types.explanation_desc
it: Spiegazioni dettagliate con esempi
ja: 例を挙げて詳しく説明
nl: Gedetailleerde uitleg met voorbeelden
sw: Maelezo ya kina na mifano
th: คำอธิบายโดยละเอียดพร้อมตัวอย่าง
uk: Детальні пояснення з прикладами
zh_hans: 带有示例的详细解释
zh_hant: 帶有範例的詳細解釋
zh_hk: 詳細解釋並舉例

# practice.generator.types.help
source: Select at least one question type
ar: حدد نوع سؤال واحد على الأقل
da: Vælg mindst én spørgsmålstype
de: practice.generator.types.help
es: Selecciona al menos un tipo de pregunta
fa: حداقل یک نوع سوال را انتخاب کنید
fi: Valitse vähintään yksi kysymystyyppi
fr: Sélectionnez au moins un type de question
he: practice.generator.types.help
it: Seleziona almeno un tipo di domanda
ja: 少なくとも 1 つの質問タイプを選択してください
nl: Selecteer minimaal één vraagtype
sw: Chagua angalau aina moja ya swali
th: เลือกประเภทคำถามอย่างน้อยหนึ่งประเภท
uk: Виберіть хоча б один тип запитання
zh_hans: 至少选择一种问题类型
zh_hant: 至少選擇一種問題類型
zh_hk: 選擇至少一種問題類型
